cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'autojump'
brew 'cmake'
brew 'ctags'
brew 'gcc'
brew 'mackup'
brew 'mas'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'tig'
brew 'tmux'
brew 'vim'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'adobe-creative-cloud'
cask 'betterzip'
cask 'firefox'
cask 'goofy'
cask 'google-chrome'
cask 'keka'
cask 'karabiner-elements'
cask 'logitech-options'
cask 'macmediakeyforwarder'
cask 'mactex'
cask 'notion'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'typora'
